[{"Name":"Bee Cool Build","Artist":{"s":"Megan Cleary and team"},"Description":"A beehive-labyrinth hybrid with a purpose. This structure is entirely hexagonal, from the actual ‘building blocks’ creating the walls to the labyrinth layout. This is a tribute to the intelligent and tenacious way bees create intricate and functional structures.","code":"bc"},{"Name":"OBSCURA","Artist":{"s":"Tiaan van Deventer"},"Description":"In the magical realm of the OBSCURA, light and imagination intertwine. Sunlight dances on the walls through a tiny aperture, creating a spellbinding, mirrored projection. This precursor to the modern camera invites us to peer through its mystical lens. Visit this year's structure for live camera action by day, chill-out vibes, and movie projections by night.","code":"ob"},{"Name":"Twist","Artist":{"s":"Mari Schroeder"},"Description":"What do seashells, hurricanes, a Slinky toy, DNA, chameleon tails, and galaxies have in common? They are Spirals! Spirals are everywhere - now also in Tankwa. They fascinate and represent growth and cycles of change. Like a Slinky toy, TWIST is a giant springy Spiral, yet very different. At TWIST, nothing is like you expect. Come and play!","code":"tw"},{"Name":"Star Tree 3","Artist":{"s":"Conrad Hubbe"},"Description":"At first, it was for myself as a gift to the observer, but now … Star Tree 3! The installation bears the imaginative fruit of Peace, Love, Unity, and Respect as it grows over several events. Come and rest in my shade. Come and imagine a future of positive life and adventure, a place where dreams are created from nothing.","code":"s3"},{"Name":"Song Catcher - The Birth Of Song","Artist":{"s":"Charles Starling"},"Description":"A giant sun-kissed dreamcatcher crowned by a six-meter wave — except this is no ordinary dreamcatcher. This is Song Catcher, an artwork that harnesses the Tankwa sun and captures the songs in the air. Positioned to greet the sunrise and sunset, a beautifully woven sun rises below the crest of a towering wave, framing a 100% solar-powered sound.","code":"sc"},{"Name":"Switch Off to Switch On","Artist":{"s":"Christophe Dardeau, Kobus Prinsloo, Nicholas Garrett"},"Description":"Switch off to Switch on is an immersive, interactive brain-shaped installation symbolising the transformative power of quieting an overstimulated mind. Accessible via a staircase, you metaphorically enter a serene mind space. Inside, you transition from external chaos to inner calm. You exit through a helix-shaped slide—a metaphor for hardcoding the insights gained into your DNA, emerging on the Binnekring transformed.","code":"sw"},{"Name":"Guys Can I DJ?","Artist":{"s":"Sailor Tinkerbell"},"Description":"Play on the biggest DJ controller you’ve ever seen! If it’s not working how you want, plug your conscious DJ wishes into USB 1, sync to the vibe, and take your “Enlighten DJ” badge. We respect talents as much as we appreciate satire, so let DJs laugh and pray but not play!","code":"dj"},{"Name":"The Pool Table At The End of The Universe","Artist":{"s":"Radical Self Rollies"},"Description":"On the edge of what we know to be space and time, where travelers' feet ache and their bones creak from the weight of exploration, there’s a pool table with a view of all creation, destruction, and all the messy bits in between, complete with lounge chairs, some razzmatazz, and all the cigarette rolling supplies a weary traveler might need.","code":"tu"},{"Name":"Amphibitheatre","Artist":{"s":"Casio Cowboy Collective"},"Description":"As the Karoo Sea vanished in the Permian era, the first amphibians crawled out of the blue, only to face Earth's largest extinction event: The Great Dying. Now, one fossilised form returns as The Amphibitheatre, a monument to evolution, extinction, and survival together. It offers shade beneath its bones by day; by night, its form encircles fire.","code":"am"},{"Name":"Benchmark","Artist":{"s":"jCona"},"Description":"More than just benches, but also just simple benches. Rest your weary legs after dancing or exploring. Take a seat, catch your breath, and maybe make a new friend. Scattered across the Binnekring, 10 benches invite connection and pause. Please enjoy them where they are placed—if you can, don’t move them.","code":"bk"},{"Name":"Dissolve in the Desert","Artist":{"s":"Bur69"},"Description":"Step into my depths, for you are not alone. Let your thoughts dissolve. Allow your past to surface. Let it drift through. Observe. Dissolve into art and poetry under the cover of darkness as they illuminate our relationship with ourselves, Mother Earth, and the Cosmos.","code":"dd"},{"Name":"Palm to Soul","Artist":{"s":"Jacques Mollentze ​from Meander Collective"},"Description":"Step into ‘Palm to Soul,’ a journey of self-reflection and community through ceramic ​sculpture that invites you to slow down and connect. Each holds​ a unique meditative message​ - read it, repeat it, and watch your own thoughts unfold as you walk from one to the next. No two journeys are the same; every step is an opportunity to create.","code":"ps"},{"Name":"Time To","Artist":{"s":"Elparo"},"Description":"“time to” seems to materialise our temporality, impalpable but concrete. We also feel this gravity, which keeps our feet on the ground. While connecting us to the earth, this volume reminds us to always look up to the sky. Sit, share and relax. Climb, dream and marvel.","code":"tt"},{"Name":"Bangers & Mash","Artist":{"s":"BAM Crew"},"Description":"Trekking the dust for salvation, our potato cart halted - a field of melted butter blobs ensnaring us. Voices from the deep yellow bade us “construct a giant masher, a shrine to the great queer potato.” It said, “Go forth, entertain, and feed the masses.” Day turned to night. Crowds gathered. The message rang out: PLAY BANGERS & SERVE MASH!","code":"bm"},{"Name":"Burn Paste-Up","Artist":{"s":"Paste-Up Collective"},"Description":"Wear Your Heart on a Paste-Up invites radical self-expression through street art. Bring your paste-up piece (≤ A4) or create one on-site, and we’ll add it to a vibrant, evolving collage. Local and global artists contribute, making a riot of color. After AfrikaBurn, lucky winners can take home pieces of the installation as keepsakes.","code":"bu"},{"Name":"Twisted Da Vinci","Artist":{"s":"Die Brandnetels"},"Description":"Out of the Blue, a twisted torus rises from the Tankwa, spinning like Da Vinci's fevered dreams - A portal yawns in the void's geometry, folding time into golden clockwork spirals. Step through, if you dare - but beware this twisted Da Vinci, his vision unspools in embered glyphs, fire devouring their maker, ashes spiraling into the eternal blueprint.","code":"dv"},{"Name":"QONGQOTHWANE","Artist":{"s":"Ceduma Qamata"},"Description":"Qongqothwane meaning “Dung Beetle” in Isixhosa is a transformative African sound journey space aimed at unraveling the myths and narratives that shape our understanding of our place within the vast network of space rooted in Africa this space invites you to embark on a journey of self-discovery and mindfulness guided by the sounds of African indigenous instruments.","code":"qq"},{"Name":"Sonic Sanctuary","Artist":{"s":"Dreamfield Collective"},"Description":"What’s the time? Half past nine, hang your brookies on the line. Time may have lost all meaning out here, but it still surrounds us. Ever needed the time in the middle of the desert? Probably not, but we've got you covered anyway. Come and see before time runs out! AND WE HAVE A SEESAW!","code":"ss"},{"Name":"Antarean Pyramid","Artist":{"s":"Starchild"},"Description":"An invitation to commune with the unexpected, the pyramid is a refuge from the tumult of stimulation. It is a dock for magical mutant madness, eddying between calm and chaos depending on the intent of the participants drifting through it.","code":""},{"Name":"8th Day of Creation","Artist":{"s":"8Doc Crew"},"Description":"\"Come and let your spirit be REBORN!\" Our 'birthing arena' reminds people of their childlike, vibrant state of being. Be embraced by the melodies of incredible musicians and DJs and workshops/performances that ignite the mind and stir the heart! There will be a music and workshop lineup throughout. This year, we burn! EVERYONE IS WELCOMED HOME.","code":"dc"},{"Name":"Ego Check Booth","Artist":{"s":"Joel Brand"},"Description":"Store your ego at our on-site facility to make your Burn more joyful, loving, and fun. Ask about our free upgrades for influencers, DJs, and anyone who has attended the Big Burn. Egos can only be returned upon presentation of the official unique claim check. Claim check supplies are limited, and any unclaimed egos will be burned.","code":"eb"},{"Name":"Space Ark","Artist":{"s":"John Innes"},"Description":"A beacon on the Binnekring for the past two years, for AfrikaBurn 2025, the Space Ark will undergo a radical transformation in the hands of a stellar team of multidisciplinary artists. The Space Ark is a vessel that will take Earth’s creatures to safety before the apocalypse arrives, the future that awaits our warming planet if humanity does not change course. Who among us will escape to safety when the day of reckoning arrives?","code":"sa"},{"Name":"Conduit ll","Artist":{"s":"Mandy Johnston"},"Description":"We are conduits of thought and makers of meaning. Through the lens of regeneration, my goal is to have and inspire meaningful conversations about rites of passage and community. I’d like to create a space for processing and acknowledging such moments of transition, one that is cognisant of the reason for these challenges and not based on fear of them.","code":"co"},{"Name":"Mirror study 01","Artist":{"s":"Frieda Beaston"},"Description":"Long, shiny things up poles! The sky behind you! And sort of over there …  Three of them can tell you true north, and if the world keeps turning, they'll recognise solar noon. Sun shiny.","code":"ms"},{"Name":"The Oasis of the Crone","Artist":{"s":"Dominique Rowberry and Aimée Barnes-Louw"},"Description":"As they age, women can feel shame, exclusion, and self-alienation. This artwork is a hopeful act of defiance. We encourage women to bravely and fully embrace who they are, ripening into ever-cooler versions of their juicy selves. The water gifted through this artwork serves as a powerful metaphor for the abundant, often unseen value that Crones bring to their communities.","code":"cr"},{"Name":"Tree of Intentions","Artist":{"s":"Tankwa Towenaars"},"Description":"The Intentionali-tree is a space for reflection, connection, and serendipity. Write an intention, hang it on the tree, and let the wind carry it to the right soul. Take an intention left by another and see where it leads you. Give, take, and let the universe do the rest. What will you leave? What will you find?","code":"ti"},{"Name":"The Unboxing","Artist":{"s":"The Unboxing Team"},"Description":"Ever kissed your front door goodbye and wondered where your walls go when they retire from holding up your secrets? Most end up in a landfill, sulking. But not here. Here, lost homes get a second chance. Leave a trinket, take a treasure—before it all spectacularly burns, serving as a fleeting reminder that all things, like socks in a dryer, eventually disappear.","code":"ux"},{"Name":"Sjohest The Sea Horse","Artist":{"s":"Fanie Moller \"Artist and Blacksmith\""},"Description":"Overlooking the Binnekring with a place for burners to sit and rest or contemplate life.","code":"sh"},{"Name":"Mankala","Artist":{"s":"Cian McClelland"},"Description":"Where rhythm, chaos, and deep existential groove collide! Pound, shake, rattle, and roll into an interactive percussion playground designed to summon your inner beat wizard. The drums & didges are back, vibrating the very fabric of reality. Bring an instrument or grab one of ours—either way, you’ll feel the beat take over. Open daily from 11 am(ish) to 8 pm(ish).","code":"mn"},{"Name":"Talk To God","Artist":{"s":"Robert Smith & The Brain"},"Description":"Dearly Beloved, you are warmly invited to take a moment to connect with the divine presence that surrounds you. Look for the blue phone box on the edge of the Binnekring and pick up the receiver. If your God is busy, please leave a message; your call is important to us.","code":"tg"},{"Name":"Best Friends","Artist":{"s":"Lynetia Botha & Quagga Landing"},"Description":"Out of the Blue, these two met. Everyone told the man that the dog would be his best friend, but no one understood that the man was the dog's best friend, too. This is a celebration of a cherished friendship and a larger-than-life tribute to a whimsical moment shared. In this space, we will playfully honour the unbreakable bond between two best friends.","code":"bf"},{"Name":"Phoenix 2025","Artist":{"s":"Wildy and Josh"},"Description":"A Phoenix on a pedestal whose wings fold open. At night, we will switch on LEDs to light it up. A person can climb up to the Phoenix and have a moment.","code":"px"},{"Name":"MoonMoth","Artist":{"s":"Nicola Harris and Ian Oberholzer"},"Description":"Moonmoth catches the first evening breeze after sunset. She flies slowly but deliberately, reflecting and projecting celestial light. Living off the energy of the Binnekring, she evolves and adapts as the week goes on.","code":"pg"},{"Name":"Skillboratory","Artist":{"s":"Maya Bogaert"},"Description":"Skillboratory?? Skillsharing? Tell me more! What happens when two strangers sit together with prompts to share skills, talents, and life wisdom? You get Skillboratory: a space where connections spark and knowledge flows. An interactive art installation where you become both teacher and student. Prompts guide conversations, unlocking ideas and inspiration. With a canopy for daily shade and stargazing by night.","code":"sb"},{"Name":"The Rave Cave","Artist":{"s":"The HiveMind Collective"},"Description":"The Rave Cave is not what it appears to be. A rave inside a cave, yes, and yet, only superficially. Within the walls of our beloved volcano base lies a secret seascape awaiting curious exploration. Multi-genre shenanigans roam the daytime from late afternoon, while at night into the early hours, a serious RAVE extravaganza is to be expected, no, demanded.","code":"rc"},{"Name":"Skeletaur","Artist":{"s":"Darryl Bailey"},"Description":"Excavated out of the deep blue sea, we showcase the life-sized skeleton of our dinosaur called Skeletaur. We built the bones of the past to remind us that nothing lasts forever. Skeletaur fits together like a large puzzle, similar to us assembling ourselves from the fossils of our past and the puzzles of life.","code":"sk"},{"Name":"Tetragon","Artist":{"s":"Frans Hollenbach"},"Description":"It is thought that all information exists. How, then, do we access it?  The black box questions the craziness of the recorded information age we live in, and how it serves us? The answers are perhaps outside the box and always have been.  Visit Tetragon, ask a question and let the burn show you the answer.","code":"te"},{"Name":"What happened to Robert Schroder?!?","Artist":{"s":"Robert Schroder is absent!"},"Description":"Where to find Robert Schroder? Where is Robert Schroder? What happened to Robert Schroder? Will we ever find Robert Schroder? This is Robert Schroder's little desert spot. Therefore, Robert is here with us.","code":"rs"},{"Name":"Stay For A Thread","Artist":{"s":"The Intertwined Collective"},"Description":"A woven wonderland—part art, part hammock, all harmonious energy. Step inside our anemone-like cube, where crochet, knots, and dangling sea creatures create a tactile, immersive escape. Weave a piece of yourself into its evolving walls, or just sink into the netted embrace. Stay a moment, stay forever or just stay for a thread.","code":"th"},{"Name":"uMlagubane","Artist":{"s":"Lungile Maletjane"},"Description":"A giant match stick reflecting on the idea of rapid combustion.","code":"um"},{"Name":"A Street Light Named dɪˈzʌɪə","Artist":{"s":"Monique Woodborne"},"Description":"Just a place to sit and observe, contemplate, or socialise.","code":"ad"},{"Name":"Burning Man Ray","Artist":{"s":"Roger Funwake"},"Description":"Man Ray’ early kinetic sculpture ‘Obstruction’ from 1920 comprised of 63 wooden coat hangers, extending outward from a single fixing point.  ‘Obstruction’ is a mathematical meditation on the process of bifurcation and infinity. Burning Man Ray is homage to Dada experiments in art and life. Bringing math, musical composition and ignition into a transient encounter.","code":"br"},{"Name":"Champagneria","Artist":{"s":"Olga Borisova"},"Description":"A rising sun. Share stories about your magical night and then head off to sleep or to start a new wonderful day.","code":"ch"},{"Name":"Eye Am Nothing Without Ewe","Artist":{"s":"KP Cote"},"Description":"A long-range peepshow kaleidoscope where you can be watched from afar by those who discover the giant spyglass mounted on a sheep.","code":"ea"},{"Name":"G String","Artist":{"s":"Chris Callor"},"Description":"A 3 dimensional spiral-graphical wave of kinetic energy.","code":"gg"},{"Name":"Humerus Molecule","Artist":{"s":"Lachlan Matthews"},"Description":"A saucy stew of science and silliness imbedded in the equanimity of Buddhism.","code":"hm"},{"Name":"Imbadu - The Gathering","Artist":{"s":"Byron Boshoff"},"Description":"A majestic 3-legged potjie sculpture transforming into a vibrant skate park, bouldering wall and a beacon for oral storytelling, music, and live performances.","code":"ig"},{"Name":"It's a sign!","Artist":{"s":"Nathan Heller"},"Description":"Reflect on the 11 principles and \"check yourself before you wreck yourself\".","code":"is"},{"Name":"Kgosigadi, the Village","Artist":{"s":"Gift Kgosierileng"},"Description":"The “Queen of the Village,” who embodies strength, culture, and unity.","code":"kv"},{"Name":"Lookout tower","Artist":{"s":"Unicorn Rainbows"},"Description":"What can you see from the Lookout Tower?","code":"lo"},{"Name":"Los Plankies","Artist":{"s":"Robert Weinek"},"Description":"Loose and haphazard, which is how you like it.","code":"lp"},{"Name":"Minikring","Artist":{"s":"Faldelah Fletcher"},"Description":"The Burn, but in miniature.","code":"mi"},{"Name":"RocKET","Artist":{"s":"Unicorn Rainbows"},"Description":"Woomph! and Vrooooooooooooph! and Crack!","code":"rt"},{"Name":"Smoking Trees of Babylon","Artist":{"s":"Richard Michalski"},"Description":"Trees of metal tubing with smoke pumping out of the branches.","code":"st"},{"Name":"The Dance of the Tetrahedra","Artist":{"s":"Sabelo Gxoyiya"},"Description":"A trio of winged Tetrahedrons.","code":"dt"},{"Name":"The Honey Bee and The Trickster","Artist":{"s":"Lauren Baker"},"Description":"An interactive, ceremonial place where people can come together and be still.","code":"hb"},{"Name":"The Lighthouse","Artist":{"s":"Alex De Mooij"},"Description":"A beacon for maritime pilots in Tankwa Town.","code":"lh"},{"Name":"The Moloporivah","Artist":{"s":"Itumeleng Kgobokoe"},"Description":"A shaded refuge in the vast openness of the Binnekring.","code":"mo"},{"Name":"Tip Top Bus Stop","Artist":{"s":"Vincent Rae"},"Description":"A space for people walking around AfrikaBurn to connect with mutant vehicles, or a simple structure to rest from the sun.","code":"bs"},{"Name":"Lunaburn","Artist":{"s":"John Macey"},"Description":"Luna was a wandering moon, a roving work of art moving around the Binnekring. But like all good things, she has grown old and tired, and her time has come to move on to better pastures.","code":"lb"},{"Name":"Sudara","Artist":{"s":"Catherine Cartwright"},"Description":"Paying tribute to the women in our lives, and the women around the world who are a part of this movement.","code":"sd"},{"Name":"The Giant Squid","Artist":{"s":"Matthew Marinovich"},"Description":"A creature that emerged from the ocean.","code":"gs"},{"Name":"INCAL","Artist":{"s":"Felix Holm"},"Description":"Markers marking the way, intersections, perimeters - other worldly road cones.","code":"in"},{"Name":"Echo : Whispers of a nearby traveler.","Artist":{"s":"Shelani van Niekerk"},"Description":"People that you love are like travellers that come to visit. So stay for a while, some stay for a day.","code":"ec"},{"Name":"Festival of light","Artist":{"s":"Handré Burger"},"Description":"A fleeting and unique ocean of light while providing a calming space in the Binnekring.","code":"fl"},{"Name":"Jupiter's Cocoon","Artist":{"s":"Jon Wreal"},"Description":"An immersive art installation embodying the sacred union of polarities, inviting participants to experience transformation through connection, healing, and spiritual growth.","code":"jc"},{"Name":"Humanity For Harmony Sculpture Garden","Artist":{"s":"Cynthia Fleischmann"},"Description":"See our similarities more than our differences, use our hands for love over hate and work towards harmony over harm.","code":"fh"},{"Name":"Unearthed - The Fossil Clan","Artist":{"s":"The Clan Crew"},"Description":"The rocks around us, silent and steadfast, have borne witness to the unimaginable expanse of time. They have seen life emerge, evolve, and flourish—each layer a preserved memory, a chapter in Earth’s ever-unfolding story. These compressed eons reveal our origins, transformations, and the deep interconnection of all things. This year, Clan honors that lineage—a rock split open, revealing the crystallised fossil of our collective journey. A symbol of endurance and change, it reminds us that we, too, are part of this vast, ancient continuum, shaped by time and still evolving, emerging—Out of the Blue.","code":"cl"},{"Name":"Light Tunnel","Artist":{"s":"Greg Mulford"},"Description":"This steel structure covered in lights is a pathway down the rabbit hole, try not to get lost and we'll see you on the other side!","code":"lt"},{"Name":"Tie Down","Artist":{"s":"Greg Mulford"},"Description":"A tie is so out of the blue at AfrikaBurn; this ±10m tie represents the opposite of what you expect to find. In memory of one of the artist's brothers, it's built with a magic tunnel of light!","code":"td"},{"Name":"A Tale of Chapters","Artist":{"s":"Laura Howell Daly"},"Description":"The door standing in the middle of the desert weaves a tale of dualities. It provides an invitation to explore uncharted territories, beckoning the courageous to open new chapters in their lives.","code":"tc"},{"Name":"The Proteas Burning Oath","Artist":{"s":"Laura Howell Daly"},"Description":"The altar stands as a symbol of devotion, intertwined with the vibrant spirit of Africa and the Burn.","code":"bo"},{"Name":"Hammer School Exhibition","Artist":{"s":"Hammer School Artists"},"Description":"A showcase of the work done by the Hammer School participants.","code":"hs"},{"Name":"The Canary's Last Breath","Artist":{"s":"Nas Sydow"},"Description":"Canaries can tell us when the air and environment are safe. Have humans heeded the call of pollution awareness?","code":"cb"}]