[{"Name":"Run Into The Blue","Description":"On Thursday, 1 May, we invite fellow blue planet residents to join us in attempting to reach the horizon. Find your way back home via a five or 10-km-ish underwater sand-swim, walk, run, cartwheel, or dance through the dusty blue desert. Meet at Triple Bypass at 7:30 am(ish). In the spirit of gifting, bring a goody bag – get a goody bag.","code":"rb","Artist":{"s":""}},{"Name":"The Midnight Melt","Description":"Sometimes, you just need a toasted cheese, and our mission is to bring the toasties to the people. The midnight melt cruises the Binnekring, turning hungry creatures into happy burners, fresh off of our portable flat-top. This year, we're introducing the Meltmobile, our small mutant companion to old Melty.","code":"mm","Artist":{"s":"\"The Melters\""}},{"Name":"Hobby Horse Arena","Description":"A very exciting day at the races, involving participants riding pretend horses made from materials like fabric, wood, or foam, and competing in races or other playful challenges.","code":"hh","Artist":{"s":"\"Laura Howell Daly\""}},{"Name":"Critical Tits Parade","Description":"A celebration of body freedom and radical self-expression! Join us at The Steampunk Saloon on Saturday at 2 pm for a pastie-making workshop and some burlesque.  Our topless parade kicks off at 4:30 pm, ending with a champagne party. Come sparkle, strut, and celebrate! All femme and nonbinary bodies welcome!","code":"ct","Artist":{"s":"\"Tenille Lindeque\""}},{"Name":"The Miss Tankwa Karoo Pageant 2025","Description":"Are you the first reigning Miss Tankwa Karoo 2025?! Do you have what it takes to be burner royalty? What do you represent? Is it your camp, your project, or just your fabulous self? Why do you do it? What’s your schtick? Is it for the children, for the flames? What fuels your passion for being Miss Tankwa Karoo?   The Miss Tankwa Karoo pageant is open to all zees, shes, and hes! All yays, theys, and gays. Step right up! This is a pageant everyone can get behind! When: Thursday. Signups: 2 pm. Prelims: 2:30 pm  Pageant: 3:00 pm. Hosted by Enos Nooki at the farthest corner of the desert  Everyone is a winner just by playing, but there will only be one crown! Also, no pageant is fair! Feel free to bribe the judges! Bribe early, bribe often! May the best Miss win!!! The pageant will be hosted by Ali Luminescent, Miss Everything to Infinity.","code":"mt","Artist":{"s":"\"Ali Luminescent\""}}]