[{"Name":"Kelpie","Description":"From the deep depths of the Kelp forest emerges a part snail, mystical creature. Protected by a squad of tough but loveable Naval marines, Kelpie will assist and protect you across the dust-filled desert - where we spread love, not war."},{"Name":"Somebody Else's Spaceship","Description":"From the future but nailed together—dance on our decks. Ride through the desert sky. We invite you to participate with us. SE'SS is the Flying Dutchman's futuristic little sister who has come back to earth, but only for seven love-fueled days."},{"Name":"Flying Dutchman","Description":"We are a playful, fun, unpretentious, burn mutant. Discover, play, cry, and fly with our crew of loving renegades."},{"Name":"Pegatuk","Description":"Pegatuk started its life in 2022 as a bicycle driven pegasus. It now draws a coach by day and night."},{"Name":"QuaggasMilk","Description":"2024 was the rebirth of extinct species - the Quagga and vintage electric milk truck. In 2025, it is back from the future; Quagga turned Cyborg – you did not expect that, did you? Still a 100% solar-powered, battery-driven vintage electric truck. @burndarlings will be roaming again – track us down and hitch a ride, if you dare ..."},{"Name":"QuaggAquarium","Description":"As QuaggAquarium emerged from the ocean, sea creatures were stranded in our vessel. We are hosting them until we submerge again. So, catch us at low tide in the Binnekring, hop on a swing and rest your feet. Enjoy an apple or a Burn biscuit. Remember, we protect Quaggafontein, and if you are an “Into the Blue” type, be afraid!"},{"Name":"Tankwartica","Description":"Our Majestic creature, the Narwal, traveling through this world and the other world, its passengers board her for different reasons: some for friendship, some for love, others simply for chat and some, a magic joy ride, a trip not to be forgotten."},{"Name":"Sisu the Dragon","Description":"Sisu the Dragon returns to AfrikaBurn, older, wiser, and more dazzling! The Kimono Dragons invite all adventurous souls to join the magic. Look for our young dragon with a warm, welcoming crew, ready to dance, laugh, and bask in good vibes. Sisu’s got a spot for everyone—come be part of the fiery fun!"},{"Name":"Dust Piranha","Description":"The Dust Piranha is a mysterious fish-like creature that we caught, tamed, and now ride over the Binnekring with a saddle on. It feeds on Burn travellers while swimming over the Binnekring. The only way to enter is through the mouth, and if you are lucky, you’ll get a treat."},{"Name":"OwLion","Description":"The OwLion is a creature of Magic. Owl head full of wisdom with the strength of the Lion's body Out of the Blue, gliding softly through the desert with participants in its warm belly until it lands when the lion roars and stomps in the dust, till the early morning hours with a great beat and the parties it is known for."},{"Name":"Sluggles","Description":"Whether Sluggles comes from Earth’s alien-like oceans or a watery planet near a distant star is unknown. She closely resembles members of the Nudibranch family, with a furry body, bubble-like tentacles and vibrant appendages that mirror these camouflage-adept slugs. Thriving in the Goldilocks Zone, she’s super-friendly, a bit shy, and has a deep love for good music."},{"Name":"NOW NOW MEOW MEOW","Description":"A fierce leopard mutant prowling the Binnekring, calling all her spotted kin. With striking feline features and glowing eyes, she’s impossible to miss. Whether she's cruising or causing mischief, one thing’s for sure—she’s always on the hunt. Be careful; she bites!"},{"Name":"Dung Beetle","Description":"The fire-farting beetle stage returns to burn. We will be gifting fuel-grade diesel created from unrecyclable waste plastic—it also works great as a fire propellant. The technology was initially developed as part of a Burning Man art grant for AfrikaBurn. Look for days, places, and times posted at Arteria, or find us in the Binnekring or through our spirit mammal, the Boomicorn!"},{"Name":"Shadow Beats Cruiser","Description":"Shadow Beats Cruiser reflects the vehicle's cool, shaded environment for partygoers enjoying the beats of the mobile DJ booth at AfrikaBurn. It embodies a sense of mystery and innovation, offering a smooth cruising experience. This mutant vehicle captures the essence of merging music and transportation in a catchy and memorable way, creating a unique and interactive platform for the community to enjoy."},{"Name":"Appa","Description":"In the heart of the desert, where fire meets dust and stars whisper secrets, our fluffy six-legged bison, Appa, awakens again. As a guardian of dreams, he glides through the universe, carrying your spirits on a journey beyond time. Nestle into his soft embrace, dance upon his enchanted decks, and lose yourself watching the magic of the flames."},{"Name":"Flying Pig","Description":"The Flying Pig is here, to fly."},{"Name":"Brandvark","Description":"Out of the blue, his crazy purple mohawk bursts into view, flying wildly in the wind. Those unmistakable tusks and a flagpole tail - all signs that it's him—Brandvark! This naughty, noisy little warthog piglet has broken free from the shackles of his mundane life in the wild and embraced his new destiny as a mutant at the burn."},{"Name":"Lunatuk","Description":"A fun, little moon buggy. It is always on the best dance floor."},{"Name":"Die Meerkatjie","Description":"From beige to psychedelic, timid to fully-expressed, Die Meerkatjie transforms with Tankwa Town, finding his true psychedelic self as he draws his clan, uniting, expressing and transforming with the spirit of AfrikaBurn."},{"Name":"The Nautilust","Description":"A Nautilus shell and a Giant squid-like creature trapped and used for buoyancy. A Nautilus of grand scale, ferocity with flaying arms and gnashing beak, tearing through ... nothing is real."},{"Name":"Old Four Legs The Deep dweller","Description":"A Coelacanth from the deep. The Sculpted wire frame with an iridescent backlit body, limbs, head and tail moves, walks and swims through the gloom of the outer barrier of the Binnekring road."},{"Name":"Watata","Description":"Inspired by the Swahili spirit of Hakuna Matata (no worries, no trouble, take it easy). A three-wheeled TukTuk transformed into a futuristic capsule, designed for the ultimate ride to sunrise and sunset."},{"Name":"Minion Dominion Banana Bus","Description":"Some minions on the roof and a banana nose on the front bonnet. Banana?"},{"Name":"Creatura","Description":"A big fluffy head with big teeth, super fluffy set of wings and a fluffy tail."},{"Name":"The Banglerfish","Description":"A giant anglerfish playing BANGERS!"},{"Name":"The Triple BJ","Description":"What's more fun than a double BJ? You guessed it."},{"Name":"Raziel","Description":"Twisted Steel and Sex Appeal."},{"Name":"Desert Crawler","Description":"A resilient creature, expertly adapted to Tankwa Town. With specialised wheels for traversing sandy terrain, it navigates the Binnekring in search of fun."},{"Name":"The Kinky Toast","Description":"Featuring a bioluminescent lure to attract prey, with a grill to toast bread."},{"Name":"Vroom Shroom","Description":"This is a Vroom Shroom. Looking as much as a mushroom as possible. Look for it at night when it is brightly lit up (to look like a mushroom)."},{"Name":"Guppy","Description":"A colorful, small freshwater mutant known for its ease of care, they are popular Binnekring pets."},{"Name":"Meraki","Description":"Meraki (pronounced may-rah-key) is derived from Greek language, and literally means the ‘essence of yourself’ that transcends many languages and cultures, and represents a concept that is deep and powerful. It is doing something with soul, creativity, passion and love."},{"Name":"Phoenix","Description":"A safe haven in Tankwa Town, and a place where its dusty children can come nest under its flowing wings"},{"Name":"Crawler","Description":"If Mad Max & Django combined, this would be the mode of transport."},{"Name":"Moguni","Description":"The little sister of MBOMBO."},{"Name":"MBOMBO Ship","Description":"MBOMBO is visiting planet Earth again. Packed with creation, life, love and magic. The mothership welcomes talents and artists from all over planet Earth to operate its out-of-space sound system. The intergalactic sound waves are part of an inner and out-of-body experience that may lead to higher states of consciousness. Enjoy the ride."},{"Name":"Sparkle Buggy","Description":"Sparkle Buggy is a fun sparkly mirror ball. Rides around the burn offering lifts for wary walkers or any one needing a ride."},{"Name":"June & Juice","Description":"Your invitation to relax, swing, and connect, fully embracing the 'Out of the Blue' in true AfrikaBurn spirit."},{"Name":"Flying (Magic) Carpet","Description":"The Flying Carpet! A legendary and mythical Mutant that can transport people through the air with its original engine powered by magic."},{"Name":"Trippy","Description":"Gliding gracefully through the Tankwa using its powerful flippers, while navigating effortlessly across the Binnekring currents."},{"Name":"Bla Bla Car","Description":"A mutant not to be taken seriously. Sheds its skin annually."},{"Name":"Boomicorn","Description":"With a kick ass laser shining out of its horn, and its fantastic LED-lit fiber mane with a tail that invites Burners to get in and cuddle!"},{"Name":"Marge","Description":"Marge returns to AfrikaBurn having had a bit of work done ... she's been nipped, tucked, and titivated."},{"Name":"Daisy","Description":"Daisy, Daisy, give me your answer do. I’m half crazy all for the love of you. Fully auto, mint condition, covered in fur and loads of lights, and can carry 4 passengers."},{"Name":"Donkey","Description":"A bad-ass barbarian Mutant. Covered in fur … the ladies love it. A Tankwa resident."},{"Name":"Nudie Blue","Description":"See it move gracefully through Tankwa Town using it's soft body and muscular contractions to glide around the Binnekring."},{"Name":"2DaMax","Description":"The apocalyptical era may be upon us, and we see 2DaMax come Out of the Blue, as a reflection of our quest to overcome challenges, embrace new horizons and ultimately survive in a crazy world."},{"Name":"InfiniteUtøpia","Description":"Music, love, peace, and \"just be\"."},{"Name":"Something Productions","Description":"An immersive theatre and movement space—a theatre stage on wheels! A collaborative art piece—an ever-changing, roving venue that evolves with each performance."},{"Name":"The Man Eater","Description":"Welcome to the world of The Man Eater, a spectacular Art Car with a singular mission: to objectify the wild and untamed essence of MEN! Those BEASTS! As night descends, The Man Eater undergoes a metamorphosis, transforming into a dazzling spectacle of lights and sound."},{"Name":"MS Mayday","Description":"MS Mayday has nautical features for naughty AfrikaBurn adventures."},{"Name":"Geodente","Description":"A big egg shaped mutant with a comet and a space ship for good measure."},{"Name":"Genuine","Description":"Genuine is a Suidae of note. Swines and sapiens will swoon. She gives new meaning to ‘piggyback ride’.  Genuine is free range. Sometimes she serves bacon."},{"Name":"GMAC","Description":"Hoots, chuckles, grunts, cries, and purrs its way across Tankwa Town."},{"Name":"Dusty","Description":"What is Dusty? Can it be found? Don't forget your goggles when searching."},{"Name":"Octopussy","Description":"You know what they say about the fittest ..."},{"Name":"Quagga Rover","Description":"The Quagga Rover roams, shining in the Karoo sunlight, Tankwa Town’s rare marvel."},{"Name":"Die Wildebeest","Description":"Farts bubbles and frightens children."},{"Name":"Sunriser","Description":"Golden rays awaken, night's shadows retreat, a new Burn begins for the Sunriser."},{"Name":"Rolling Blackout","Description":"We have been EskomMoonikated (like from the church, just ours is from the grid). Moo, our 11 times Metastofasised mootant, is incorporated into the name of course and will have a roving frame to capture moments when out and about."},{"Name":"Super Sonic Porcupine","Description":"In Tankwa Town, the super sonic porcupine roams, its quills gleam softly, a spiky mobile home.A gentle mutant, cautious and shy, roaming the Binnekring under a starlit sky."},{"Name":"The Chillmosine","Description":"The Chillmosine, offers you the luxury of cursing [sic] around the Binnekring after a full day of volunteering."},{"Name":"Delirian Mach 1","Description":"It’s a buggy mutated to look like an intergalactic drug dealer’s sports car. It also has a bar built into the back so we can serve iced beverages to thirsty travellers."},{"Name":"Sweet Dreams","Description":"A floating cloud of cheeky fun."},{"Name":"The Beatroot","Description":"You can't squeeze blood out of a turnip, but you can squeeze a beat out of a Beatroot."},{"Name":"Loki","Description":"Loki the Rhino is the EDM-Loving God of Mischief and made his debut at AfrikaBurn 2014. Legend has it that if you tickle his chin just right and find the right one of his keepers you might score yourself a little gift."},{"Name":"Shimmy Shimmy Steam Steam","Description":"An extension of the Steampunk Saloon - think ethereal feminine magic intertwined with mutant innovation. She is a safe and versatile space with no fixed seating but a platform that shape-shifts from a burlesque stage to an art tour odyssey wagon to a dance floor for mobile spontaneous shimmies (with spankings and whiskey on the side, of course)."},{"Name":"Blue Bed","Description":"The Blue Bed whispers your dreams and invites you to climb into her comfortable embrace."},{"Name":"Deep Amazon","Description":"An Amazon themed Tiki bar on wheels."},{"Name":"Pipe Car","Description":"A yelly-wish in blue light."},{"Name":"Klip Vis","Description":"A speed boat for deep sea hippie fishing."},{"Name":"Los Ballas","Description":"A wheelbarrow with garden furniture and a small engine … and we will drag any Los Ballas out and off the Binnekring."},{"Name":"Rumble Bottom","Description":"A beany on the run with extra fur."},{"Name":"The Dust Machine","Description":"A carnival extravaganza and playground on wheels."},{"Name":"SpongeBob","Description":"This mutant vehicle lives in a pineapple under the sea."},{"Name":"Zeus","Description":"The sky and thunder god in ancient Greek religion and Mutant Vehicle mythology, who rules as king of the gods on the Binnekring. Loud, straight piped, fully roadworthy, fully operational."},{"Name":"Moroccan Wine bar","Description":"Cutting grinding and welding is the name of the game."},{"Name":"Queen Bee","Description":"Bzzzz, bzzzzzzz, bzzzzz, bzzzzzz, bzzzzzzz, bzzzz, bzzzzzzz."},{"Name":"Froggie Scoot","Description":"This mutant is covered in beautiful shiny warts and has crouched legs ready to leap!"},{"Name":"Priscilla, Queen of the Desert","Description":"A moving, breathing castle, held together by magic and moon dust! Priscilla is a moving collection of windows, chairs, timber, ladders, leather, sheet metal, a chicken, the kitchen sink, and your mom’s famous roast potatoes, powered by a fire demon located deep in her soul."},{"Name":"Flight Of PhantaSea","Description":"A steam punk shell with wings."},{"Name":"Bomberos dela Playa","Description":"Construido en madera y acero pintado en colores fuego de la época de 1920. El vehículo parecerá un vehículo de extinción de incendios. Habrá escaleras al lado para la apariencia."},{"Name":"Get Mushy","Description":"Get Mushy broke in half and still made it home. It has character. That's our boy."},{"Name":"Karow Kruiser","Description":"A friendly car, happy to pick up anyone who wants a ride. With its shimmering exterior and all neon lights, it will be easy to spot at day and night and will light up the Binnekring."},{"Name":"Sefala Nomadica","Description":"Sefala Nomadica roams freely, exploring Tankwa Town, embracing adventure and endless tunes."},{"Name":"Blue and Red","Description":"What were the skies like when you were young? They went on forever and they, when I, we lived in Arizona, and the skies always had little fluffy clouds in them and, they were long and clear and, there were lots of stars at night"},{"Name":"Human Transporter Centipede","Description":"We know how to theme mos ja awe."},{"Name":"Allure","Description":"Lo and behold, a mobile party with a lure to entice lost stragglers out of the desert."},{"Name":"Insight","Description":"The Insight Art Car explores the mysteries of insight, creating a shared unconscious process. With its dynamic design, lighting effects, and electronic music, it invites participants to explore the interplay of light and shadow, symbolising the dance of life and guiding its journey through the desert landscape."},{"Name":"Dragon Wagon and Dragon Heart","Description":"The Dragon Wagon is the big brother of Dragon Heart. She is based on an ancient truck from 1976 and has a dance floor for 30 people. Are you ready?"},{"Name":"The Tripping Taurus","Description":"The Taurus is symbolic of the celestial lunar month of AfrikaBurn - The Month of May. The Tripping Taurus is not alone. It pulls a modern rendition of the ‘Ossewa’ that can carry a few passengers."},{"Name":"Foxy Loxy","Description":"We're all different—especially Foxy Loxy. But there's something kind of fantastic about that, isn't there?"},{"Name":"Bing Bong Bash","Description":"How are you mutating your vehicle?"},{"Name":"Kudu Kart","Description":"A mesmerising bloom of jellyfish, spreading light and enchantment wherever we go."},{"Name":"The Hula Hauler","Description":"Went here on our recent date night and it was so cool! Very cosy little mutant vehicle with an awesome atmosphere. Drinks were yummy. Each with their own quirky twists. We had the best time here! We will definitely be returning."},{"Name":"Lekke Rover","Description":"There goes my love rocket red. Shoot it up. Shoot it up."},{"Name":"Dragon Sledge","Description":"Without fear and beyond reproach."},{"Name":"The Procrastinator","Description":"Always arriving at the last minute."},{"Name":"The Big Blue Drop","Description":"The Big Blue Drop covers about 71% of the Earth's surface."},{"Name":"Scorpius Blue","Description":"Scorpions? Never seen em."},{"Name":"The Tuna Twins","Description":"Groups of just three fish already move in a similar way to large schools while, by contrast, two fish display completely different behaviour."},{"Name":"Snuggle Puff","Description":"King size bed, good condition, hardly used. Will not respond to 'is it still available'."},{"Name":"Skudu","Description":"Extravagantly roams the Binnekring with finesse and power. Its rugged grunt combined with its gracious demeanour encapsulates this magnificent mechanical antelope. Touch its horn, it might get excited, I know you will."},{"Name":"Zogy Jellypuss","Description":"Top secret. You'll know when you see it."},{"Name":"The Aardvark","Description":"Chop it up and keep chopping. May or may not look like an Aardvark."},{"Name":"Baby Appa Fluffball","Description":"A sphere of fluffy fur with two glowing horns."},{"Name":"Something Fishy","Description":"An illusion of a floating, swimming fish."},{"Name":"Aaadoons","Description":"With steel, blood and guts, it once appeared in an episode of 7de Laan."},{"Name":"Bernard","Description":"As brave as a bear, and as bright as a star ... that's Bernard."},{"Name":"Madman Cart","Description":"A jellyfish fresh Out of the Blue."},{"Name":"The Bakkery","Description":"A mobile French boulangerie and patisserie, straight from the streets of Paris. A beacon of light and fluffy dough for all to enjoy."},{"Name":"Bahardi Desert Burnguard","Description":"The Bahardi Desert Burnguard and its team of lifeguards strive hard to control the AfrikaBurn crowds and keep them safe from the raging seas while also exploring adventures in their personal lives."},{"Name":"Into the Red - Negative Space 2.0","Description":"A ballooning mutant fuel bill and demands from the Tankwa Town population have pushed Negative Space into the red."},{"Name":"Dabble","Description":"Return my treasures to me, and I myself will carry you through the gates of Valhalla. You shall ride eternal. Shiny, and chrome."},{"Name":"Nirvana NowNow","Description":"Two-stroke, son. Nothing else in the world smells like that. I love the smell of two-stroke in the morning."},{"Name":"The Love Bug","Description":"Ooooooo, catch that buzz. The Love Bug is the one I'm thinking of."},{"Name":"Your Bar","Description":"This is not just any bar; this is Your Bar, with the best bartenders in all the land."},{"Name":"Dolf","Description":"Calm seas, still air, sailors' patience tested, adventure paused."},{"Name":"Dude","Description":"He's a mutant, for crying out loud. Didn't you see that big wave hit him? Well, dude, that's the whole idea of surfing."},{"Name":"Duke","Description":"Fight on and fly on to the last drop of blood and the last drop of fuel, to the last beat of the heart."},{"Name":"Dave","Description":"Dave peaked in popularity in the Karoo around 1960, and declined pretty consistently between then and now, so older people (who are more likely to be named Dave) are more likely to know mutants named Dave."},{"Name":"Dinky","Description":"Dinky is a small mutant plane. Dinky can also be seen from miles away!"},{"Name":"Disco Biscuit","Description":"Before time began, there was the Disco Biscuit. We know not where it comes from, only that it holds the power to create worlds and fill them with life."},{"Name":"Doc","Description":"Doc is a dragon."},{"Name":"Drifting in the clouds","Description":"Soar above the clouds of Tankwa Town."},{"Name":"Surf Rider Buggy","Description":"Fine crafted for Tankwa royalty, that has  also been blessed with prayers."},{"Name":"Lemon Ship","Description":"Is it flying? No! But it's an Airplane? Yes, and it's going to make you fly!"},{"Name":"It's a Bathtard","Description":"If you could only feel 100% relaxed and don’t have to think all the time, wouldn’t you try and build a mutant bath?"},{"Name":"Big G","Description":"A Granada station wagon, fresh from the streets of Tatooine."},{"Name":"Jelly Fish","Description":"A floating jellyfish complete with mama jellyfish and her children."},{"Name":"Bubbles Mobile","Description":"A large octopus made from reused ocean materials."},{"Name":"The Hop-On-Porta-Nose-Eros","Description":"A small heavy mutant with very thick skin that lives in Africa."},{"Name":"Boater Cycle","Description":"Riding waves and making memories."},{"Name":"Spikey","Description":"Spikey, whom one must handle gloved, may be respected, and always loved."},{"Name":"Cloudy with a chance of...","Description":"Altocumulus, altostratus, nimbostratus, cirrus, cirrocumulus and cirrostratus."},{"Name":"Skillywag","Description":"Easy wind, going cross the Binnekring today. There's a whole lotta Burners Out of the Blue today."},{"Name":"Snooze Cruise","Description":"This luxury bed on wheels glides across the Binnekring, providing a space for participants to relax, recharge, and connect."},{"Name":"Tropical Utopia","Description":"Throw off your shirt and let's get hot, hot, hot."},{"Name":"Mad Max Jail Time","Description":"A chaotic fusion of rusted metal, repurposed materials."},{"Name":"Ghost Busters","Description":"Do you believe in UFOs, astral projections, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full trance mediums, the Loch Ness monster and the theory of Atlantis?"},{"Name":"Gooi Mealies Mobile","Description":"Mobile, tried and tested."},{"Name":"Booty Buccaneer","Description":"Prepare your booty for plundering!"},{"Name":"Quagga Carrier","Description":"Remember this mutant when you look at the night sky!"},{"Name":"Drone","Description":"The only drone allowed in Tankwa Town."},{"Name":"Nitro","Description":"Powerful, explosive energy, fuels speed, adrenaline rush, thrilling experience."},{"Name":"The Sound Police","Description":"Woop-woop, that's the sound of The Sound Police."},{"Name":"CinoMobile","Description":"Covered in the softest, cutest, fluffiest fabric with floppy ears"},{"Name":"Dune Buggy Depth Charger","Description":"A rugged, versatile, off-road, water-ready, adventure mutant."},{"Name":"Quinta Cyclic Petro Keg","Description":"The Quinta Keg is a monowheel with a sidecar and front wheel for stability and steering. It’s a two-seater and runs on a 150cc scooter engine."},{"Name":"Quackalicious","Description":"Quackalicious you're the one. You make bath time lots of fun. Quackalicious I'm awfully fond of you."},{"Name":"Tetanus Rex","Description":"A mobile beduin tent to chill in while cruising across the Binnekring."},{"Name":"Quagga","Description":"It's a Quagga. Sometimes mistaken for a Zebra."}]