[{"Name":"Underdog","Artist":{"s":"Junkanew and The OV Arts Collective"},"Description":"Underdog, top dog, man's best friend, pesky opportunist, evolutionary companion, fur baby—we are looking at taboos, hierarchy, and status. Wild dog, tame dog, cur, vagabond street dog—it's a dog-eat-dog world. It's a dog's life. Exploring our inner dog, our motley crew will go for a walk at dusk daily to do what dogs do.","code":"ud"},{"Name":"The Dance of 1000 Flames","Artist":{"s":"All the fire dancers of AfrikaBurn"},"Description":"The biggest fire dancing jam in Africa! Gathered around the Clan before it burns on Saturday, all the fire dancers of Burn will share their love of Fire and Flow with you. NB Fire Dancers must meet at sunset on Saturday at the Clan to be safety briefed before spinning - any experienced spinners are welcome! More info at Camp 404.","code":"d1"},{"Name":"Azania","Artist":{"s":"Zizipho Gcasamba"},"Description":"Highlighting the richness of African music, dance, and culture, with traditional rhythms, movements, and attires that celebrate the beauty of our continent.","code":"az"},{"Name":"BABA YAYA Performances","Artist":{"s":"Benjamin Nivison"},"Description":"A unique blend of Hip Hop, dance theatre, African contemporary and improvisation. Pop up dance performances around the various artworks and stages.","code":"by"},{"Name":"Forefathers Ensemble","Artist":{"s":"Bolepu Mathabatha"},"Description":"A Kora player, an indigenous African harp, guitarist, percussionist, saxophonist and vocalists which plays a variety of African rhythms and melodies which comes from different parts of Africa.","code":"fe"},{"Name":"Kaalvoet Prinses","Artist":{"s":"Lana Cavernelis"},"Description":"Kaalvoet Prinses is a singer, lyricist, and gender-peace activist who founded the Barefoot Campaign.","code":"kp"},{"Name":"Kwagga and the Endangered Friends","Artist":{"s":"Katlego Gabashane"},"Description":"Featuring the endangered and extinct animals of South Africa.","code":"ke"},{"Name":"Magic by August","Artist":{"s":"August Müller"},"Description":"Roaming magic shows ... Out of the Blue!","code":"ma"},{"Name":"Message From The Outer Cape","Artist":{"s":"Quintin Goliath"},"Description":"An alchemist and futurist calculates the right alignment of the stars for his cosmic, glowing, and ethereal alien visitor to arrive.","code":"oc"},{"Name":"Reclaim the Runway","Artist":{"s":"Shona Macdonald"},"Description":"Walk down the runway and inspire others on what can be done to be sustainable in fashion.","code":"rr"},{"Name":"Sterra on Percussion","Artist":{"s":"Sithembiso Sihlangu"},"Description":"Unite in the rhythm of a drum. Humming, chants and expression.","code":"so"},{"Name":"Tiego. The Moondust World Experience","Artist":{"s":"Tiego Ndhlovu"},"Description":"An infusion of story telling combined with dancing and unique masks that emit light.","code":"tm"},{"Name":"Ubuciko BaseMjondolo","Artist":{"s":"Sinenhlanhla Mgeyi"},"Description":"A vibrant and dynamic structure, composition, and narrative, showcasing the fusion of Kofifi, Bollywood, and Gumboots dance styles.","code":"ub"},{"Name":"Umuthiomkhulu Ensemble","Artist":{"s":"Mthimkhulu Stuurman"},"Description":"A unique approach to African Spiritual Jazz. The music is connected to the roots of African people ... In simple terms, these songs are the sound form equivalent to praying or conversing with your ancestors directly.","code":"ue"},{"Name":"Zazi","Artist":{"s":"Andisiwe Meje"},"Description":"A collective of innovators, artists, and visionaries dedicated to pushing the boundaries of fashion, art, and self-expression","code":"za"}]